Repository: tsinis/tsin.is
Catalog: lib/l10n/intl_*.arb
Languages: cs, ru, sk

source: About
cs: O mně
ru: Обо мне
sk: O mne

source: Check
cs: Zkoumat
ru: Проверьте
sk: Skúmať

source: Contacts
cs: Kontakty
ru: Контакты
sk: Kontakty

# contactsDesc
source: Physically in the city of Brno, on the internets, I'm known as a “tsinis”:
cs: Fyzicky jsem v Brně, na internetu, znám spíše jako „tsinis“:
ru: Физически нахожусь в Брно, в этих интернетах я известен как «tsinis»:
sk: Fyzicky som v Brne, na internete, známy skôr ako „tsinis“:

# devAndDesigner
source: Flutter Developer & Designer
cs: Flutter vývojář a grafik
ru: Flutter разработчик и дизайнер
sk: Flutter vývojár a grafik

# email
source: or just simply write me the good old e-mail here:
cs: nebo mi prostě napište starý dobrý e-mail:
ru: или же просто напишите мне на электронную почту:
sk: alebo mi jednoducho napíšte starý dobrý e-mail:

# findInPortfolio
source: Here you can find
cs: Zde najdete
ru: Здесь вы найдёте
sk: Tu nájdete

# flutterClock
source: This project is one of the winning submissions in Official Google's & Lenovo dev/design contest, called “Flutter Clock” (with almost a thousand entries worldwide).
cs: Tento projekt je jedním z vítězů ve společné vývojářské/design soutěži firem Google a Lenovo, pod názvem “Flutter Clock” (se skoro tisícovkou příspěvků z celého světa).
ru: Этот проект является одним из победителей совместного конкурса, компаний Google и Lenovo, под названием «Flutter Clock» (с почти тысячей проектов со всего мира).
sk: Tento projekt je jedným z víťazov v spoločnej vývojárske/dizajn súťaži firiem Google a Lenovo, pod názvom "Flutter Clock" (sa skoro tisíckou príspevkov z celého sveta).

# fullName
source: Roman Cinis
ru: Роман Цинис

# greeting
source: Hello there, I'm
cs: Vítejte, jsem
ru: Приветствую, я
sk: Vitajte, som

# helloDribbble
source: Interactive animations showcase project, I've made, as my Debut Shot for legendary Dribbble.com, аfter I won the invitation (so now as a “Player”).
cs: Toto je projekt ukazující Interaktivní animace, které jsem vytvořil jako svůj Debut na legendárním Dribbble, poté co jsem, nedávno, dostal vytoužené pozvaní.
ru: Этот проект — демонстрация интерактивных анимаций, сделанных в качестве Дебюта на легендарном Dribbble, на который я получил долгожданное приглашение.
sk: Toto je projekt ukazujúce Interaktívne animácie, ktoré som vytvoril ako svoj Debut na legendárnom Dribbble, potom čo som, nedávno, dostal vytúžené pozvaní.

# iAm
source: I'm awarded T-shaped specialist in the fields of Flutter Development and Design, with great love for interactive animations and good UX. Let's make something awesome together! Grab my CV here:
cs: Jsem oceněným „T-shaped“ specialistou jakožto Flutter vývojář a grafik, s velkou láskou k interaktivním animacím a dobrému UX. Udělejme něco úžasného společně! Chcete vědět více?
ru: Я награждённый T-специалист в области Flutter разработки и дизайна, с большой любовью к интерактивным анимациям и хорошему UX. Давайте сделаем что-то классное вместе! Скачайте моё резюме тут:
sk: Som oceneným „T-shaped“ špecialistom ako Flutter vývojár a grafik, s veľkou láskou k interaktívnym animáciám a dobrému UX. Urobme niečo úžasné spoločne! Chcete vedieť viac?

# cloud
source: All language versions
cs: Všechny jazyky
ru: Все языковые варианты
sk: Všetky jazyky

source: in Action
cs: v akci
ru: в действии
sk: v akcii

source: Language
cs: Jazyk
ru: Язык
sk: Jazyk

source: Portfolio
ru: Портфолио
sk: Portfólio

# projectsPortfolio
source: projects and repositories.
cs: projektů a repositářů.
ru: проектов и репозиториев
sk: projektov a repozitárov.

source: See
cs: Zhlédnout
ru: Смотреть
sk: Pozrieť

# somePortfilio
source: some of my
cs: některé z mých
ru: некоторые из моих
sk: niektoré z mojich

source: the Code
cs: kód
ru: код
sk: kód

source: the Design
cs: design
ru: дизайн
sk: dizajn

# thisWeb
source: This Website
cs: Táto webová stránka
ru: Этот веб-сайт
sk: Táto webová stránka

# thisWebDesc
source: Obviously, this entire website is made in Flutter and written on pure Dart. The one and only third-party dependency is the animation in the About section, which was made in Rive.
cs: Samozřejmé, že celý tento web je vytvořen ve Flutteru a je napsán na čistém Dartu. Závislost jedné a jediné, třetí strany je animace v sekci "O mně", která byla vytvořena v Rive.
ru: Разумеется, весь этот сайт написан в Flutter на чистейшем Dart. Единственная сторонняя зависимость тут — это анимация в секции «Обо мне», которая сделана в Rive.
sk: Samozrejmé, že celý tento web je vytvorený vo Flutter a je napísaný na čistom Dart. Závislosť jednej a jediné, tretie strany je animácia v sekcii "O mne", ktorá bola vytvorená v Rive.

source: Tongue Twisters
cs: Jazykolamy
ru: Скороговорки
sk: Jazykolamy

# tongueTwistersDesc
source: Application for testing tongue twisters with focus on the design. Created it in coop with illustrator – license do not allow me to open source (i.e. illustrations).
cs: Aplikace pro testování jazykolamů, se zaměřením na design. Vytvořeno ve spolupráci s ilustrátorem — proto licence mi neumožňuje otevřít zdroj (tj. i ilustrace).
ru: Аппликация создана для тестирования скороговорок с главным упором на дизайн. Создана совместно с иллюстратором, потому правила лицензии не позволяет мне выложить проект (т.е. и иллюстрации) в открытый доступ.
sk: Aplikácia pre testovanie jazykolamov, so zameraním na dizajn. Vytvorené v spolupráci s ilustrátorom - preto licencie mi neumožňuje otvoriť zdroj (tj. aj ilustrácie).
